miguelAvina1/LPC845-BRK/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v8.0
processor: LPC845
package_id: LPC845M301JBD48
mcu_data: ksdk2_0
processor_version: 8.0.2
board: LPC845BREAKOUT
pin_labels:
- {pin_num: '11', pin_signal: PIO1_0/CAPT_X1, label: LED GREEN}
- {pin_num: '14', pin_signal: PIO1_1/CAPT_X2, label: LED BLUE}
- {pin_num: '16', pin_signal: PIO1_2/CAPT_X3, label: LED RED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iocon.h"
#include "fsl_swm.h"
#include "pin_mux.h"

#define IOCON_PIO_MODE_INACT 0x00u   /*!<@brief No addition pin function */


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
	BOARD_InitSWD_DEBUGPins();
	BOARD_InitBUTTONsPins();
	BOARD_InitLEDsPins();
	BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSWD_DEBUGPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '8', peripheral: SWD, signal: SWCLK, pin_signal: SWCLK/PIO0_3, mode: pullUp, invert: disabled, hysteresis: enabled, opendrain: disabled, smode: bypass,
    clkdiv: div0}
  - {pin_num: '10', peripheral: SWD, signal: SWDIO, pin_signal: SWDIO/PIO0_2, mode: pullUp, invert: disabled, hysteresis: enabled, opendrain: disabled, smode: bypass,
    clkdiv: div0}
  - {pin_num: '33', peripheral: ADC0, signal: 'CH, 0', pin_signal: PIO0_7/ADC_0}
  - {pin_num: '13', peripheral: I2C0, signal: SCL, pin_signal: PIO0_10/I2C0_SCL, i2cmode: fastMode}
  - {pin_num: '12', peripheral: I2C0, signal: SDA, pin_signal: PIO0_11/I2C0_SDA}
  - {pin_num: '9', peripheral: CAPT, signal: 'CAPTX, 0', pin_signal: PIO0_31/CAPT_X0}
  - {pin_num: '1', peripheral: CAPT, signal: CAPTYL, pin_signal: PIO1_8/CAPT_YL}
  - {pin_num: '3', peripheral: CAPT, signal: CAPTYH, pin_signal: PIO1_9/CAPT_YH}
  - {pin_num: '42', peripheral: GPIO, signal: 'PIO0, 30', pin_signal: PIO0_30/ACMP_I5}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSWD_DEBUGPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitSWD_DEBUGPins(void)
{
	/* Enables clock for IOCON.: enable */
	CLOCK_EnableClock(kCLOCK_Iocon);
	/* Enables clock for switch matrix.: enable */
	CLOCK_EnableClock(kCLOCK_Swm);

	IOCON->PIO[8] = ((IOCON->PIO[8] &
			/* Mask bits to zero which are setting */
			(~(IOCON_PIO_I2CMODE_MASK)))

			/* Selects I2C mode.: Standard mode/ Fast-mode I2C. */
			| IOCON_PIO_I2CMODE(PIO0_10_I2CMODE_STANDARAD_I2C));

	const uint32_t IOCON_INDEX_PIO0_2_config = (/* Selects pull-up function */
			IOCON_PIO_MODE_PULLUP |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PIO0 PIN2 (coords: 10) is configured as SWD, SWDIO. */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_2, IOCON_INDEX_PIO0_2_config);

	const uint32_t IOCON_INDEX_PIO0_3_config = (/* Selects pull-up function */
			IOCON_PIO_MODE_PULLUP |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PIO0 PIN3 (coords: 8) is configured as SWD, SWCLK. */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_3, IOCON_INDEX_PIO0_3_config);

	const uint32_t IOCON_INDEX_PIO0_30_config = (/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PORT0 PIN30 (coords: ) is configured as  */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_30, IOCON_INDEX_PIO0_30_config);

	const uint32_t IOCON_INDEX_PIO0_31_config = (/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PORT0 PIN31 (coords: ) is configured as  */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_31, IOCON_INDEX_PIO0_31_config);

	const uint32_t IOCON_INDEX_PIO1_8_config = (/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PORT1 PIN8 (coords: ) is configured as  */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_8, IOCON_INDEX_PIO1_8_config);

    const uint32_t IOCON_INDEX_PIO1_0_config = (/* No addition pin function */
                                                IOCON_PIO_MODE_INACT |
                                                /* Enable hysteresis */
                                                IOCON_PIO_HYS_EN |
                                                /* Input not invert */
                                                IOCON_PIO_INV_DI |
                                                /* Disables Open-drain function */
                                                IOCON_PIO_OD_DI |
                                                /* Bypass input filter */
                                                IOCON_PIO_SMODE_BYPASS |
                                                /* IOCONCLKDIV0 */
                                                IOCON_PIO_CLKDIV0);
    /* PORT1 PIN0 (coords: ) is configured as  */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_0, IOCON_INDEX_PIO1_0_config);

    const uint32_t IOCON_INDEX_PIO0_4_config = (/* Selects pull-up function */
                                                IOCON_PIO_MODE_PULLUP |
                                                /* Enable hysteresis */
                                                IOCON_PIO_HYS_EN |
                                                /* Input not invert */
                                                IOCON_PIO_INV_DI |
                                                /* Disables Open-drain function */
                                                IOCON_PIO_OD_DI |
                                                /* Bypass input filter */
                                                IOCON_PIO_SMODE_BYPASS |
                                                /* IOCONCLKDIV0 */
                                                IOCON_PIO_CLKDIV0);
    /* PORT0 PIN4 (coords: ) is configured as  */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_4, IOCON_INDEX_PIO0_4_config);

	const uint32_t IOCON_INDEX_PIO1_9_config = (/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PORT1 PIN9 (coords: ) is configured as  */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_9, IOCON_INDEX_PIO1_9_config);

	/* SWCLK connect to P0_3 */
	SWM_SetFixedPinSelect(SWM0, kSWM_SWCLK, true);

	/* SWDIO connect to P0_2 */
	SWM_SetFixedPinSelect(SWM0, kSWM_SWDIO, true);

	/* I2C0_SDA connect to P0_11 */
	SWM_SetFixedPinSelect(SWM0, kSWM_I2C0_SDA, true);

	/* I2C0_SCL connect to P0_10 */
	SWM_SetFixedPinSelect(SWM0, kSWM_I2C0_SCL, true);

	/* ADC_CHN0 connect to P0_7 */
	SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN0, true);

    /* ACMP_INPUT5 connect to P0_30 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ACMP_INPUT5, true);

    /* CAPT_X0 connect to P0_31 */
    SWM_SetFixedPinSelect(SWM0, kSWM_CAPT_X0, true);

    /* CAPT_YL connect to P1_8 */
    SWM_SetFixedPinSelect(SWM0, kSWM_CAPT_YL, true);

    /* CAPT_YH connect to P1_9 */
    SWM_SetFixedPinSelect(SWM0, kSWM_CAPT_YH, true);

	/* Disable clock for switch matrix. */
	CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBUTTONsPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '6', peripheral: GPIO, signal: 'PIO0, 4', pin_signal: PIO0_4/ADC_11, mode: pullUp, invert: disabled, hysteresis: enabled, opendrain: disabled, smode: bypass,
    clkdiv: div0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBUTTONsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitBUTTONsPins(void)
{
	/* Enables clock for IOCON.: enable */
	CLOCK_EnableClock(kCLOCK_Iocon);

	const uint32_t K3 = (/* Selects pull-up function */
			IOCON_PIO_MODE_PULLUP |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PIO0 PIN4 (coords: 6) is configured as GPIO, PIO0, 4. */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_4, K3);

	/* Disable clock for switch matrix. */
	CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '11', peripheral: GPIO, signal: 'PIO1, 0', pin_signal: PIO1_0/CAPT_X1, mode: pullUp, invert: disabled, hysteresis: enabled, opendrain: disabled, smode: bypass,
    clkdiv: div0}
  - {pin_num: '14', peripheral: GPIO, signal: 'PIO1, 1', pin_signal: PIO1_1/CAPT_X2, mode: pullUp, invert: disabled, hysteresis: enabled, opendrain: disabled, smode: bypass,
    clkdiv: div0}
  - {pin_num: '16', peripheral: GPIO, signal: 'PIO1, 2', pin_signal: PIO1_2/CAPT_X3, mode: pullUp, invert: disabled, hysteresis: enabled, opendrain: disabled, smode: bypass,
    clkdiv: div0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitLEDsPins(void)
{
	/* Enables clock for IOCON.: enable */
	CLOCK_EnableClock(kCLOCK_Iocon);

	const uint32_t IOCON_INDEX_PIO1_0_config = (/* Selects pull-up function */
			IOCON_PIO_MODE_PULLUP |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PIO1 PIN0 (coords: 11) is configured as GPIO, PIO1, 0. */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_0, IOCON_INDEX_PIO1_0_config);

	const uint32_t IOCON_INDEX_PIO1_1_config = (/* Selects pull-up function */
			IOCON_PIO_MODE_PULLUP |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PIO1 PIN1 (coords: 14) is configured as GPIO, PIO1, 1. */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_1, IOCON_INDEX_PIO1_1_config);

	const uint32_t IOCON_INDEX_PIO1_2_config = (/* Selects pull-up function */
			IOCON_PIO_MODE_PULLUP |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PIO1 PIN2 (coords: 16) is configured as GPIO, PIO1, 2. */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO1_2, IOCON_INDEX_PIO1_2_config);

	/* Disable clock for switch matrix. */
	CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '20', peripheral: USART0, signal: RXD, pin_signal: PIO0_24, mode: pullUp, invert: disabled, hysteresis: enabled, opendrain: disabled, smode: bypass,
    clkdiv: div0}
  - {pin_num: '19', peripheral: USART0, signal: TXD, pin_signal: PIO0_25, mode: pullUp, invert: disabled, hysteresis: enabled, opendrain: disabled, smode: bypass,
    clkdiv: div0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitDEBUG_UARTPins(void)
{
	/* Enables clock for IOCON.: enable */
	CLOCK_EnableClock(kCLOCK_Iocon);
	/* Enables clock for switch matrix.: enable */
	CLOCK_EnableClock(kCLOCK_Swm);

	const uint32_t DEBUG_UART_RX = (/* Selects pull-up function */
			IOCON_PIO_MODE_PULLUP |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PIO0 PIN24 (coords: 20) is configured as USART0, RXD. */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_24, DEBUG_UART_RX);

	const uint32_t DEBUG_UART_TX = (/* Selects pull-up function */
			IOCON_PIO_MODE_PULLUP |
			/* Enable hysteresis */
			IOCON_PIO_HYS_EN |
			/* Input not invert */
			IOCON_PIO_INV_DI |
			/* Disables Open-drain function */
			IOCON_PIO_OD_DI |
			/* Bypass input filter */
			IOCON_PIO_SMODE_BYPASS |
			/* IOCONCLKDIV0 */
			IOCON_PIO_CLKDIV0);
	/* PIO0 PIN25 (coords: 19) is configured as USART0, TXD. */
	IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_25, DEBUG_UART_TX);

	/* USART0_TXD connect to P0_25 */
	SWM_SetMovablePinSelect(SWM0, kSWM_USART0_TXD, kSWM_PortPin_P0_25);

	/* USART0_RXD connect to P0_24 */
	SWM_SetMovablePinSelect(SWM0, kSWM_USART0_RXD, kSWM_PortPin_P0_24);

	/* Disable clock for switch matrix. */
	CLOCK_DisableClock(kCLOCK_Swm);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
